guix.org
#+TITLE: GNU Guix on Xubuntu, literate and sovereign
#+AUTHOR: Mètsàtron
#+LANGUAGE: en
#+PROPERTY: header-args :mkdirp yes :results silent :comments both

* Intent
A minimal, sovereign Guix install on a Debian-family host, managed from this repo.
We keep privileged steps explicit, package state declarative, and paths inside overlays.
Nothing in here overwrites your shell files directly, it only adds small blocks that tangle into your existing exports files.

* Layout
- Guix channels, profiles, manifests under =all/.config/guix/=
- Helper scripts under =all/.local/bin/=
- Shell exports for PATH added in tiny, self-contained blocks that tangle into =all/.bash_exports= and =all/.zsh_exports=
- No files removed, only appended sections with clear sentinels
  

* One-time system bootstrap
Only run once on this machine. This mirrors the upstream manual for a foreign distro install.

#+BEGIN_SRC bash :tangle no
# 0) Prereqs
sudo apt update
sudo apt install -y build-essential git curl xz-utils bzip2

# 1) Download official installer, verify, run
cd /tmp
rm -f guix-install.sh guix-install.sh.sig

# Follow redirects and fail if not 200
curl -fL -o guix-install.sh 'https://git.savannah.gnu.org/cgit/guix.git/plain/etc/guix-install.sh'
# Quick sanity check
head -n 3 guix-install.sh
# Expect to see: #!/bin/sh on the first line
chmod +x guix-install.sh
# Optional: verify PGP signature if you added Guix keys
# Run the installer
sudo ./guix-install.sh

# 2) Authorize substitute servers, improves build time
# ci.guix.gnu.org should be present after installer, we add bordeaux as well if available
if [ -r /usr/share/guix/bordeaux.guix.gnu.org.pub ]; then
  sudo guix archive --authorize < /usr/share/guix/bordeaux.guix.gnu.org.pub
fi

# 3) Enable and start the daemon
sudo systemctl enable --now guix-daemon
systemctl status guix-daemon --no-pager
#+END_SRC

If the installer complains about guixbuild users, re-run it or create them with =addgroup guixbuild= and =adduser --system= 10 workers linked to that group, which the installer usually handles.

* Channels, manifests, profiles
** Channel pin template (seed only once)
#+BEGIN_SRC scheme :tangle all/.config/guix/channels.scm.base
;; TEMPLATE for authenticated Guix channel (seed file)
(list
  (channel
    (name 'guix)
    (url "https://git.savannah.gnu.org/git/guix.git")
    (introduction
      (make-channel-introduction
        "9edb3f66fd807b096b48283debdcddccfea34bad"
        (openpgp-fingerprint
         "BBB0 2DDF 2E8C 26C5 7D28  9DDA 013A 06C9 4F2A E8C4")))))
#+END_SRC

* Optional: channel mirror for faster pull
:PROPERTIES:
:CREATED:  [2025-09-25]
:END:

#+BEGIN_SRC scheme :tangle all/.config/guix/channels.scm.mirror
;; Mirror-based channel. Use temporarily if Savannah is slow. Check freshness.
(list
  (channel
    (name 'guix)
    ;; Example mirror: Codeberg maintained copy
    (url "https://codeberg.org/guix/guix.git")
    (introduction
      (make-channel-introduction
        "9edb3f66fd807b096b48283debdcddccfea34bad"
        (openpgp-fingerprint
         "BBB0 2DDF 2A54 27B3 78B2 6E33 4B04 82B6 6299 CBB6")))))
#+END_SRC

# Usage:
#   mv ~/.config/guix/channels.scm ~/.config/guix/channels.scm.bak
#   cp all/.config/guix/channels.scm.mirror ~/.config/guix/channels.scm
#   guix pull
# Then restore when done.

** User profile manifests
Tangling target: =all/.config/guix/manifests/core.scm= and friends.
#+BEGIN_SRC scheme :tangle all/.config/guix/manifests/core.scm
(specifications->manifest
 '(
   "git" "htop" "ripgrep" "fd" "jq" "direnv" "btop"
   "python" "node"
   "glibc-locales"   ; for UTF-8 locales
   "nss-certs"       ; TLS certs for HTTPS
   "emacs"           ; or "emacs-pgtk" if you prefer pgtk
   "emacs-vterm"     ; native vterm module for Emacs
   "libvterm"
   "neovim"
   "lsd" "ranger"
   "python-numpy" "python-sympy" "python-coloredlogs" "python-humanfriendly" "python-send2trash" "python-websockets" "python-unidecode" "python-wheel"
   "moreutils"
   "gimp"
   "appmenu-gtk-module"
   "maak" "guile"
   ))
#+END_SRC

#+BEGIN_SRC scheme :tangle all/.config/guix/manifests/dev.scm
(specifications->manifest
 '(
   "gcc-toolchain"
   "gdb"
   "cmake"
   "pkg-config"
   "meson"
   "ninja"
   "shellcheck"
   "shfmt"
   "bear"
   ))
#+END_SRC

Add more manifests as needed, for example =audio.scm= or =media.scm=. Keep them small and purposeful.

** Guix (bench caches + pull that never re-benchmarks)
#+BEGIN_SRC makefile :tangle all/.mk/guix.mk :mkdirp yes
# all/.mk/guix.mk
ifndef GUIX_MK_INCLUDED
GUIX_MK_INCLUDED := 1

.RECIPEPREFIX := |
SHELL := /bin/bash
.ONESHELL:

GUIX ?= guix
GUIX_HOME := $(HOME)/.config/guix
EXTRA := $(HOME)/.guix-extra-profiles
BENCH_DIR := $(GUIX_HOME)/.bench
PULL_CACHE := $(BENCH_DIR)/pull-url
FALLBACK_PULL_URLS ?= https://git.cbaines.net/guix/guix https://codeberg.org/guix/guix.git https://git.savannah.gnu.org/git/guix.git

.PHONY: guix-dirs guix-pull-bench guix-pull guix-core guix-dev guix-gc

guix-dirs:
| @chmod +x $(HOME)/.local/bin/guix-mkdirs 2>/dev/null || true
| @$(HOME)/.local/bin/guix-mkdirs
| @mkdir -p $(BENCH_DIR)
# 1) BENCH → writes cache, prints URL (LOUD)
guix-pull-bench: guix-dirs
| set -Eeuo pipefail; \
| BENCH="$(HOME)/.dotfiles/all/.local/bin/guix-bench-pull"; \
| [ -x "$$BENCH" ] || { echo "guix-bench-pull not found/executable" >&2; exit 1; }; \
| URL="$$( "$$BENCH" )" || URL=""; \
| if [ -z "$$URL" ]; then echo "No URL found by bench" >&2; exit 1; fi; \
| echo "$$URL" >"$(PULL_CACHE)"; \
| echo "cached: $(PULL_CACHE) → $$URL"; \
| echo "$$URL"

# 2) PULL → uses cached URL if present; NEVER re-bench
guix-pull: guix-dirs
| set -Eeuo pipefail; \
| URL=""; [ -r "$(PULL_CACHE)" ] && URL="$$(tr -d '\r\n' <"$(PULL_CACHE)")"; \
| tried=0; \
| success=0; \
| choose_and_pull() { \
|   u="$$1"; \
|   [ -z "$$u" ] && return 1; \
|   tried=1; \
|   echo "guix pull --url=$$u (cached/fallback)"; \
|   if $(GUIX) pull --url="$$u"; then \
|     success=1; \
|     printf '%s\n' "$$u" >"$(PULL_CACHE)";  # <-- promote last success to cache
|     return 0; \
|   else \
|     return 1; \
|   fi; \
| }; \
| # 1) try cached (if present)
| if [ -n "$$URL" ]; then \
|   choose_and_pull "$$URL" || echo "cached URL failed → trying fallbacks…"; \
| fi; \
| # 2) try fallbacks (skip if equal to cached)
| if [ "$$success" -eq 0 ]; then \
|   for fb in $(FALLBACK_PULL_URLS); do \
|     [ "$$fb" = "$$URL" ] && continue; \
|     if choose_and_pull "$$fb"; then break; fi; \
|   done; \
| fi; \
| # 3) final fallback: plain `guix pull` (no mirror override)
| if [ "$$success" -eq 0 ]; then \
|   if [ "$$tried" -eq 1 ]; then echo "all mirrors failed → falling back to plain 'guix pull'"; else echo "guix pull (no cache present)"; fi; \
|   $(GUIX) pull; \
| fi

guix-core: guix-dirs
| mkdir -p $(EXTRA)/core
| $(GUIX) package -m $(GUIX_HOME)/manifests/core.scm -p $(EXTRA)/core/core

guix-dev: guix-core
| mkdir -p $(EXTRA)/dev
| $(GUIX) package -m $(GUIX_HOME)/manifests/dev.scm -p $(EXTRA)/dev/dev

guix-gc:
| $(GUIX) gc
endif
#+END_SRC

** Profile directories
We keep explicit profile prefixes under =~/.guix-extra-profiles= so nothing bleeds into your main profile unless you choose so.
#+NAME: guix-dirs
#+BEGIN_SRC bash :tangle all/.local/bin/guix-mkdirs :shebang "#!/usr/bin/env bash"
set -euo pipefail
# Add any profiles you plan to use here:
profiles=(core dev)

for name in "${profiles[@]}"; do
  base="$HOME/.guix-extra-profiles/$name"
  mkdir -p "$base"
  echo "Ensured: $base"
done
#+END_SRC

Tangling target: none, just convention used by scripts below:
- =~/.guix-extra-profiles/core=
- =~/.guix-extra-profiles/dev=

* Apply profiles
#+BEGIN_SRC bash :tangle no
# 1) Ensure profile dirs exist
~/.local/bin/guix-mkdirs

# 2) Apply core manifest to named profile
~/.local/bin/guix-profile-apply core "$HOME/.config/guix/manifests/core.scm"

# 3) (Optional) Apply dev manifest too
# ~/.local/bin/guix-profile-apply dev "$HOME/.config/guix/manifests/dev.scm"
#+END_SRC

* Session wiring for Guix profiles
#+BEGIN_SRC bash :tangle linux/.xsessionrc.d/20-guix-core-profile.sh :shebang "#!/usr/bin/env bash"
set -euo pipefail
export GUIX_PROFILE="$HOME/.guix-extra-profiles/core/core"
if [ -r "$GUIX_PROFILE/etc/profile" ]; then
  . "$GUIX_PROFILE/etc/profile"
fi
#+END_SRC

* GTK appmenu env
#+BEGIN_SRC conf :tangle linux/.config/environment.d/20-gtk-appmenu.conf
GTK_MODULES=appmenu-gtk-module
#+END_SRC

* Helper scripts
Tangling target: =all/.local/bin/guix-profile-apply=, =guix-profile-list=, =guix-gc-safe=, =guix-search=

#+BEGIN_SRC bash :tangle all/.local/bin/guix-profile-apply :shebang "#!/usr/bin/env bash"
set -euo pipefail
# Apply a manifest to a named profile under ~/.guix-extra-profiles/<name>
name="${1:-}"
manifest="${2:-}"
if [ -z "$name" ] || [ -z "$manifest" ]; then
  echo "Usage: $(basename "$0") <profile-name> <manifest.scm>" >&2
  exit 1
fi
base="$HOME/.guix-extra-profiles/$name"
mkdir -p "$base"
guix package -m "$manifest" -p "$base/$name"
echo "Profile updated: $base/$name"
echo "To activate in this shell:"
echo "  GUIX_PROFILE=$base/$name; . \"$GUIX_PROFILE/etc/profile\""
#+END_SRC

#+BEGIN_SRC bash :tangle all/.local/bin/guix-profile-list :shebang "#!/usr/bin/env bash"
set -euo pipefail
find "$HOME/.guix-extra-profiles" -maxdepth 2 -type d -name "*-link" 2>/dev/null | sort || true
echo
echo "User generations:"
guix package --list-generations || true
#+END_SRC

#+BEGIN_SRC bash :tangle all/.local/bin/guix-gc-safe :shebang "#!/usr/bin/env bash"
set -euo pipefail
echo "Showing store disk usage:"
guix gc --list-live
echo
echo "Running garbage collection for unused items..."
guix gc
echo "Done."
#+END_SRC

#+BEGIN_SRC bash :tangle all/.local/bin/guix-search :shebang "#!/usr/bin/env bash"
set -euo pipefail
if [ $# -eq 0 ]; then
  echo "Usage: $(basename "$0") <query...>" >&2
  exit 1
fi
guix search "$@"
#+END_SRC

** Apply cached Guix pull mirror (no bench)
#+BEGIN_SRC bash :tangle all/.local/bin/guix-apply-pull-url :shebang "#!/usr/bin/env bash" :tangle-mode (identity #o755) :mkdirp yes
#!/usr/bin/env bash
# Usage:
#   guix-apply-pull-url [URL]
# Behavior:
#   - If URL arg given → use that.
#   - Else read ~/.config/guix/.bench/pull-url.
#   - Never runs the bench itself.
set -Eeuo pipefail

CACHE="$HOME/.config/guix/.bench/pull-url"
URL="${1:-}"

if [[ -z "$URL" ]]; then
  [[ -r "$CACHE" ]] || { echo "No cached mirror. Run 'loom guix:pull-bench' first or pass URL." >&2; exit 1; }
  URL="$(tr -d $'\r\n' < "$CACHE")"
fi

REPO_DIR="$HOME/.dotfiles/all/.config/guix"
CHAN_FILE="$REPO_DIR/channels.scm"
mkdir -p "$REPO_DIR"
ts="$(date +%Y%m%d-%H%M%S)"
[[ -f "$CHAN_FILE" ]] && cp -a "$CHAN_FILE" "$CHAN_FILE.bak.$ts"

# Official guix channel introduction (stable across mirrors)
INTRO_COMMIT="9edb3f66fd807b096b48283debdcddccfea34bad"
INTRO_FP="BBB0 2DDF 2E8C 26C5 7D28  9DDA 013A 06C9 4F2A E8C4"

tmp="$(mktemp)"
cat >"$tmp" <<EOF
;; Auto-generated by guix-apply-pull-url on $ts
;; Mirror chosen: $URL
(list
  (channel
    (name 'guix)
    (url "$URL")
    (introduction
      (make-channel-introduction
        "$INTRO_COMMIT"
        (openpgp-fingerprint "$INTRO_FP")))))
EOF

install -m 0644 "$tmp" "$CHAN_FILE"
rm -f "$tmp"

echo "Updated repo file:"
echo "  $CHAN_FILE"
echo "Mirror: $URL"
echo "→ Run 'loom stow' to deploy into ~/.config/guix/channels.scm"
#+END_SRC

** Bench fastest Guix channel mirror
#+BEGIN_SRC bash :tangle all/.local/bin/guix-bench-pull :shebang "#!/usr/bin/env bash" :tangle-mode (identity #o755) :mkdirp yes
#!/usr/bin/env bash
set -Eeuo pipefail

# Benchmark Guix channel mirrors for `guix pull`.
# - Per-URL result lines (to STDERR)
# - Best URL (to STDOUT only)
# Env:
#   GUIX_PULL_CANDIDATES="url1 url2 …" to override list
#   GUIX_PULL_TIMEOUT=15  (git ls-remote timeout seconds)
#   GUIX_PULL_VERBOSE=1   (default 1; controls STDERR chatter)
# Flags:
#   -v/--verbose     force verbose
#   --force-curl     skip git timing; use curl HEAD latency

VERBOSE="${GUIX_PULL_VERBOSE:-1}"
TIMEOUT="${GUIX_PULL_TIMEOUT:-15}"
FORCE_CURL=0

for a in "$@"; do
  case "$a" in
    -v|--verbose) VERBOSE=1 ;;
    --force-curl) FORCE_CURL=1 ;;
    *) ;;
  esac
done

# Default candidates (include Codeberg)
CANDIDATES=(
  "https://git.savannah.gnu.org/git/guix.git"
  "https://mirror.git.savannah.gnu.org/r/guix.git"
  "https://git.cbaines.net/guix/guix"
  "https://codeberg.org/guix/guix.git"
)
[ -n "${GUIX_PULL_CANDIDATES:-}" ] && read -r -a CANDIDATES <<<"${GUIX_PULL_CANDIDATES}"

have_git=0
if [ "$FORCE_CURL" -eq 0 ] && command -v git >/dev/null 2>&1; then
  have_git=1
fi

ptime_git() { # -> float seconds or 99
  local url="$1" t
  t="$( TIMEFORMAT=%R; { time git ls-remote --heads --tags --refs --timeout="$TIMEOUT" "$url" >/dev/null 2>&1; } 2>&1 )" || t=99
  printf '%s' "$t"
}

ptime_curl() { # -> float seconds or 99
  curl -sS -o /dev/null -m "$TIMEOUT" -w '%{time_total}' -I "$1" || printf '%s' 99
}

mode_desc() { [ "$have_git" -eq 1 ] && echo "git" || echo "curl"; }

[ "$VERBOSE" -eq 1 ] && {
  >&2 echo "guix-bench-pull: probing ${#CANDIDATES[@]} candidate(s) using $(mode_desc)… (timeout=${TIMEOUT}s)"
}

best=""; best_t="999999"
any_ok=0

# header
[ "$VERBOSE" -eq 1 ] && >&2 printf '%-52s  %8s  %s\n' "URL" "TIME(s)" "MODE"

for url in "${CANDIDATES[@]}"; do
  # try git timing first unless forced curl / no git
  t="99"; mode="$(mode_desc)"
  if [ "$have_git" -eq 1 ]; then
    t="$(ptime_git "$url")"
    if [ "$t" = "99" ]; then
      # fallback to curl latency for this URL only
      t="$(ptime_curl "$url")"
      mode="curl"
    fi
  else
    t="$(ptime_curl "$url")"
    mode="curl"
  fi

  [ "$t" != "99" ] && any_ok=1

  # pretty row
  [ "$VERBOSE" -eq 1 ] && >&2 printf '%-52s  %8s  %s\n' "$url" "$t" "$mode"

  # numeric compare (float-safe)
  awk -v a="$t" -v b="$best_t" 'BEGIN{exit (a+0<b+0)?0:1}' \
  && { best="$url"; best_t="$t"; }
done

if [ -n "$best" ] && [ "$any_ok" -eq 1 ]; then
  [ "$VERBOSE" -eq 1 ] && >&2 echo "best=${best} time=${best_t}"
  echo "$best"
  exit 0
fi

# If absolutely everything failed (all 99), still return a sane default.
fallback="https://git.savannah.gnu.org/git/guix.git"
[ "$VERBOSE" -eq 1 ] && >&2 echo "guix-bench-pull: all probes failed; falling back to ${fallback}"
echo "$fallback"
exit 0
#+END_SRC

** Substitutes bench script (loud, hardcoded list, env-override)
#+BEGIN_SRC bash :tangle all/.local/bin/guix-bench-substitutes :shebang "#!/usr/bin/env bash" :tangle-mode (identity #o755) :mkdirp yes
#!/usr/bin/env bash
set -Eeuo pipefail

VERBOSE="${GUIX_SUB_VERBOSE:-1}"

# Hardcoded default set (literate, reproducible)
CANDIDATES=( "https://bordeaux.guix.gnu.org" "https://ci.guix.gnu.org" "https://substitutes.nonguix.org" )
[ -n "${GUIX_SUB_CANDIDATES:-}" ] && read -r -a CANDIDATES <<< "${GUIX_SUB_CANDIDATES}"

DEFAULT_PKGS=(bash coreutils grep sed gzip nss-certs glibc neovim)
[ -n "${GUIX_SUB_BENCH_PKGS:-}" ] && read -r -a DEFAULT_PKGS <<< "${GUIX_SUB_BENCH_PKGS}"

TIMEOUT=25
if guix weather --help 2>/dev/null | grep -q -- '--timeout'; then
  TIMEOUT_FLAG=(--timeout="$TIMEOUT")
else
  TIMEOUT_FLAG=()
fi

[ "$VERBOSE" -eq 1 ] && {
  >&2 echo "guix-bench-substitutes: probing ${#CANDIDATES[@]} server(s) with guix weather…"
  >&2 echo "PKGS: ${DEFAULT_PKGS[*]}"
  >&2 echo
}

tmp="$(mktemp)"; err="$(mktemp)"; sum="$(mktemp)"
trap 'rm -f "$tmp" "$err" "$sum"' EXIT

ok_any=0
for url in "${CANDIDATES[@]}"; do
  [ "$VERBOSE" -eq 1 ] && >&2 echo "=== $url ==="
  if guix weather "${TIMEOUT_FLAG[@]}" --substitute-urls="$url" "${DEFAULT_PKGS[@]}" >"$tmp" 2>"$err"; then
    ok_any=1
    avail="$(grep -Eo '([0-9]+\.[0-9]+|[0-9]+)% substitutes available' "$tmp" | awk '{print $1}' | head -n1 || echo 0)"
    items="$(grep -Eo '\([0-9]+ out of [0-9]+\)' "$tmp" | sed -E 's/^\(([0-9]+) out of [0-9]+\)$/\1/' | head -n1 || echo 0)"
    speed="$(grep -Ei 'estimated download speed' "$tmp" | grep -Eo '[0-9.]+\s*(KiB/s|MiB/s|GiB/s)' | head -n1 || echo unknown)"
    [ "$VERBOSE" -eq 1 ] && {
      >&2 echo "availability=${avail}%  items=${items}  speed=${speed}"
      >&2 echo
      sed -n '1,80p' "$tmp" >&2
      >&2 echo
    }
    printf "SUMMARY|%s|%s|%s\n" "$url" "$avail" "$items" >>"$sum"
  else
    [ "$VERBOSE" -eq 1 ] && { echo "ERROR probing $url" >&2; sed -n '1,40p' "$err" >&2; echo >&2; }
    printf "SUMMARY|%s|0|0\n" "$url" >>"$sum"
  fi
done

if (( ok_any )); then
  [ "$VERBOSE" -eq 1 ] && >&2 echo "Ranking by availability then items…"
  mapfile -t order < <(awk -F'|' '/^SUMMARY\|/ {printf "%s %s %s\n",$2,$3,$4}' "$sum" \
    | sort -k2,2nr -k3,3nr | awk '{print $1}')
  [ "$VERBOSE" -eq 1 ] && >&2 echo "Chosen order: ${order[*]}"
  printf "%s\n" "${order[*]}"
  exit 0
fi

[ "$VERBOSE" -eq 1 ] && >&2 echo "weather failed; falling back to curl HEAD latency…"
declare -A latency ok
for url in "${CANDIDATES[@]}"; do
  read -r code total <<<"$(curl -sS -o /dev/null -w "%{http_code} %{time_total}" -m 10 -I "$url" || echo "000 99")"
  latency["$url"]="$total"; ok["$url"]="$code"
  [ "$VERBOSE" -eq 1 ] && >&2 echo "curl: $url  code=$code  time=${total}s"
done
mapfile -t order < <(for u in "${!latency[@]}"; do printf "%s %s %s\n" "${latency[$u]}" "${ok[$u]}" "$u"; done \
  | awk '$2!="000"{print}' | sort -n | awk '{print $3}')
[ "${#order[@]}" -gt 0 ] && { [ "$VERBOSE" -eq 1 ] && >&2 echo "Chosen order (latency): ${order[*]}"; printf "%s\n" "${order[@]}"; } || printf "%s\n" "${CANDIDATES[@]}"
#+END_SRC

** Guix substitutes (bench caches order; apply reads cache only)
#+BEGIN_SRC makefile :tangle all/.mk/guix-substitutes.mk :mkdirp yes
ifndef GUIX_SUBS_MK_INCLUDED
GUIX_SUBS_MK_INCLUDED := 1

.RECIPEPREFIX := |
SHELL := /bin/bash
.ONESHELL:

BENCH_DIR := $(HOME)/.config/guix/.bench
SUB_CACHE := $(BENCH_DIR)/substitute-order

.PHONY: guix-sub-bench guix-sub-apply

guix-sub-bench:
| set -Eeuo pipefail; \
| mkdir -p "$(BENCH_DIR)"; \
| ORDER="$$( ~/.local/bin/guix-bench-substitutes | awk 'NF{last=$$0} END{print last}' )"; \
| if [ -z "$$ORDER" ]; then echo "No ORDER from bench" >&2; exit 1; fi; \
| echo "$$ORDER" >"$(SUB_CACHE)"; \
| echo "cached: $(SUB_CACHE) → $$ORDER"; \
| echo "$$ORDER"

guix-sub-apply:
| set -Eeuo pipefail; \
| [ -r "$(SUB_CACHE)" ] || { echo "No $(SUB_CACHE). Run 'make -f all/.mk/guix-substitutes.mk guix-sub-bench' first." >&2; exit 1; }; \
| ORDER="$$(tr -d '\r\n' <"$(SUB_CACHE)")"; \
| if [ -z "$$ORDER" ]; then echo "Empty $(SUB_CACHE)" >&2; exit 1; fi; \
| DAEMON_BIN="$$(systemctl show -p ExecStart guix-daemon 2>/dev/null | sed -E 's/^ExecStart=..([^ ]*guix-daemon).*/\1/')"; \
| if [ -z "$$DAEMON_BIN" ] || [ ! -x "$$DAEMON_BIN" ]; then DAEMON_BIN="/var/guix/profiles/per-user/root/current-guix/bin/guix-daemon"; fi; \
| sudo mkdir -p /etc/systemd/system/guix-daemon.service.d; \
| tmp="$$(mktemp)"; \
| printf '%s\n' \
|   "[Service]" \
|   "Environment=GUIX_LOCPATH=/var/guix/profiles/per-user/root/guix-profile/lib/locale" \
|   "ExecStart=" \
|   "ExecStart=$$DAEMON_BIN --build-users-group=guixbuild --substitute-urls=\"$$ORDER\"" \
|   > "$$tmp"; \
| sudo install -m 0644 "$$tmp" /etc/systemd/system/guix-daemon.service.d/override.conf; \
| rm -f "$$tmp"; \
| sudo systemctl daemon-reload; \
| sudo systemctl restart guix-daemon; \
| systemctl --no-pager status guix-daemon || true
endif
#+END_SRC

** Nonguix substitutes (own cache; apply reads cache only)
#+BEGIN_SRC makefile :tangle all/.mk/nonguix-substitutes.mk :mkdirp yes
ifndef NONGUIX_SUBS_MK_INCLUDED
NONGUIX_SUBS_MK_INCLUDED := 1

.RECIPEPREFIX := |
SHELL := /bin/bash
.ONESHELL:

BENCH_DIR := $(HOME)/.config/guix/.bench
NONGUIX_SUB_CACHE := $(BENCH_DIR)/nonguix-substitute-order

.PHONY: nonguix-sub-bench nonguix-sub-apply nonguix-authorize-key

nonguix-sub-bench:
| set -Eeuo pipefail; \
| mkdir -p "$(BENCH_DIR)"; \
| ORDER="$$( GUIX_SUB_CANDIDATES='https://substitutes.nonguix.org https://bordeaux.guix.gnu.org https://ci.guix.gnu.org' \
|            ~/.local/bin/guix-bench-substitutes | awk 'NF{last=$$0} END{print last}' )"; \
| if [ -z "$$ORDER" ]; then echo "No ORDER from bench" >&2; exit 1; fi; \
| echo "$$ORDER" >"$(NONGUIX_SUB_CACHE)"; \
| echo "cached: $(NONGUIX_SUB_CACHE) → $$ORDER"; \
| echo "$$ORDER"

nonguix-sub-apply:
| set -Eeuo pipefail; \
| [ -r "$(NONGUIX_SUB_CACHE)" ] || { echo "No $(NONGUIX_SUB_CACHE). Run 'make -f all/.mk/nonguix-substitutes.mk nonguix-sub-bench' first." >&2; exit 1; }; \
| ORDER="$$(tr -d '\r\n' <"$(NONGUIX_SUB_CACHE)")"; \
| if [ -z "$$ORDER" ]; then echo "Empty $(NONGUIX_SUB_CACHE)" >&2; exit 1; fi; \
| DAEMON_BIN="$$(systemctl show -p ExecStart guix-daemon 2>/dev/null | sed -E 's/^ExecStart=..([^ ]*guix-daemon).*/\1/')"; \
| [ -z "$$DAEMON_BIN" -o ! -x "$$DAEMON_BIN" ] && DAEMON_BIN="/var/guix/profiles/per-user/root/current-guix/bin/guix-daemon"; \
| sudo mkdir -p /etc/systemd/system/guix-daemon.service.d; \
| tmp="$$(mktemp)"; \
| printf '%s\n' \
|   "[Service]" \
|   "Environment=GUIX_LOCPATH=/var/guix/profiles/per-user/root/guix-profile/lib/locale" \
|   "ExecStart=" \
|   "ExecStart=$$DAEMON_BIN --build-users-group=guixbuild --substitute-urls=\"$$ORDER\"" \
|   > "$$tmp"; \
| sudo install -m 0644 "$$tmp" /etc/systemd/system/guix-daemon.service.d/override.conf; \
| rm -f "$$tmp"; \
| sudo systemctl daemon-reload; \
| sudo systemctl restart guix-daemon; \
| systemctl --no-pager status guix-daemon || true

nonguix-authorize-key:
| set -Eeuo pipefail; \
| if [ -r /usr/share/guix/nonguix.pub ]; then key=/usr/share/guix/nonguix.pub; \
| elif [ -r /etc/guix/nonguix.pub ]; then key=/etc/guix/nonguix.pub; \
| elif [ -r $(HOME)/.dotfiles/all/.config/guix/nonguix-signing-key.pub ]; then key=$(HOME)/.dotfiles/all/.config/guix/nonguix-signing-key.pub; \
| else echo "WARNING: nonguix key not found. Put it at all/.config/guix/nonguix-signing-key.pub and rerun." >&2; exit 0; fi; \
| echo "Authorizing nonguix key: $$key"; \
| sudo guix archive --authorize < "$$key"
endif
#+END_SRC

* Substitutes: authorize keys
#+BEGIN_SRC bash :tangle no
set -Eeuo pipefail
if [ -r /usr/share/guix/ci.guix.gnu.org.pub ]; then
  sudo guix archive --authorize < /usr/share/guix/ci.guix.gnu.org.pub
fi
if [ -r /usr/share/guix/bordeaux.guix.gnu.org.pub ]; then
  sudo guix archive --authorize < /usr/share/guix/bordeaux.guix.gnu.org.pub
fi
#+END_SRC

* Batch Emacs (quiet harmless banners)
#+BEGIN_SRC bash :tangle all/.local/bin/emacs-batch-quiet :shebang "#!/usr/bin/env bash"
set -Eeuo pipefail
EMACS_BIN="$(command -v emacs)"
exec /bin/bash -c '
  {
    exec 3>&1
    exec 4>&2
    "'"$EMACS_BIN"'" "$@" \
      2> >(grep -v -E "(no version information available).*(libxml2|librsvg|libm17n-core)" >&4) \
      1>&3
  }
' bash "$@"
#+END_SRC

** Neovide → Guix Neovim
- Create a tiny wrapper so Neovide always uses your Guix nvim:
#+BEGIN_SRC bash :tangle linux/.local/bin/neovide-core :shebang "#!/usr/bin/env bash"
set -euo pipefail
NVIM="$HOME/.guix-extra-profiles/core/core/bin/nvim"
res="$(xrandr 2>/dev/null | awk '/\*/{print $1; exit}')"
args=(--neovim-bin="$NVIM")
[ -n "${res:-}" ] && args+=(--size="$res")
exec neovide "${args[@]}" "$@"
#+END_SRC

** AstroNvide → Guix Neovim
- Create a tiny wrapper so Neovide always uses your Guix nvim:
#+BEGIN_SRC bash :tangle linux/.local/bin/astronvide :shebang "#!/usr/bin/env bash"
set -euo pipefail
NVIM="$HOME/.guix-extra-profiles/core/core/bin/nvim"
res="$(xrandr 2>/dev/null | awk '/\*/{print $1; exit}')"
export NVIM_APPNAME=astronvim
args=(--neovim-bin="$NVIM")
[ -n "${res:-}" ] && args+=(--size="$res")
exec neovide "${args[@]}" "$@"
#+END_SRC

** Goneovim → Guix Neovim
- Create a tiny wrapper so Neovide always uses your Guix nvim:
#+BEGIN_SRC bash :tangle linux/.local/bin/goneovim-core :shebang "#!/usr/bin/env bash"
set -euo pipefail
NVIM="$HOME/.guix-extra-profiles/core/core/bin/nvim"
if goneovim --help 2>&1 | grep -q -- '--nvimpath'; then
  exec goneovim --nvimpath "$NVIM" --maximized "$@"
else
  exec goneovim --neovim-bin "$NVIM" --maximized "$@"
fi
#+END_SRC

** VSCodium Neovim extension → Guix Neovim
- Set the path in settings.json (and ensure the file exists):
#+BEGIN_SRC json :tangle all/.config/VSCodium/User/settings.json :mkdirp yes :comments no
{
  // --- vscode-neovim wiring ---
  "vscode-neovim.neovimExecutablePaths.linux": "/home/metsatron/.guix-extra-profiles/core/core/bin/nvim",
  "vscode-neovim.neovimInitPath": "/home/metsatron/.dotfiles/all/.config/nvim/vscode/init.lua",
  "extensions.experimental.affinity": { "asvetliakov.vscode-neovim": 1 },

  // optional: prevent host PATH from shadowing Guix
  "terminal.integrated.env.linux": {
    "PATH": "/home/metsatron/.guix-extra-profiles/core/core/bin:${env:PATH}"
  },

  // --- Fonts (editor/terminal/preview) ---
  "editor.fontFamily": "'SF Mono','SFMono Nerd Font','JetBrainsMono Nerd Font',Menlo,Monaco,'Courier New',monospace",
  "editor.fontLigatures": true,
  "terminal.integrated.fontFamily": "'SFMono Nerd Font Mono','SF Mono','SFMono Nerd Font',monospace",
  "markdown.preview.fontFamily": "'SF Pro Text','SF Pro Display','San Francisco',-apple-system,system-ui,sans-serif",
  "notebook.output.fontFamily": "'SF Pro Text','San Francisco',-apple-system,system-ui,sans-serif",
  "workbench.fontAliasing": "antialiased",
  "workbench.colorTheme": "Default Dark+",
  "yaml.schemas": {
    "file:///home/metsatron/.vscode-oss/extensions/continue.continue-1.0.23-linux-x64/config-yaml-schema.json": [
      ".continue/**/*.yaml"
    ]
  },
  "explorer.confirmDragAndDrop": false,
  "explorer.confirmDelete": false,
  "workbench.iconTheme": "se98",
  "workbench.productIconTheme": "Tabler",
  "terminal.integrated.inheritEnv": false,
  "workbench.activityBar.location": "top",
  "vscode-neovim.compositeKeys": {}
}
#+END_SRC

* Daily use, cheat-sheet
- Update channels then upgrade user profiles
  #+BEGIN_SRC bash :tangle no
  guix pull
  make guix-core guix-dev
  # Activate a profile in your current shell if you want its tools
  export GUIX_PROFILE="$HOME/.guix-extra-profiles/core/core"
  . "$GUIX_PROFILE/etc/profile"
  #+END_SRC
- Search packages
  #+BEGIN_SRC bash :tangle no
  guix-search neovim
  #+END_SRC
- Roll back a profile
  #+BEGIN_SRC bash :tangle no
  guix package -p "$HOME/.guix-extra-profiles/core/core" --roll-back
  #+END_SRC
- List user generations and extra profiles
  #+BEGIN_SRC bash :tangle no
  guix-profile-list
  #+END_SRC
- Collect garbage safely
  #+BEGIN_SRC bash :tangle no
  guix-gc-safe
  #+END_SRC

* Notes
- Guix Home is intentionally not enabled here, since you use literate dotfiles as the source of truth. We keep Guix focused on packages and profiles.
- If you ever add =nonguix=, you must explicitly authorize its substitute key. Keep that ritual documented alongside the channels pin.
- Guix can install many tools that overlap with apt, snaps, or flatpaks. Prefer one source per tool to reduce path ambiguity.

* Known issue: Inkscape via Guix (pinned note)
:PROPERTIES:
:CREATED:  [2025-09-24]
:END:

Symptoms (current channel snapshot):
- Runtime complains: libxml2 “no version information available”
- Crash from libxslt: undefined symbol ‘inputPush, version LIBXML2_2.4.30’

Repro snippets:
#+BEGIN_SRC bash
guix shell --pure inkscape -- inkscape
# or show what binary actually runs:
REAL="$(readlink -f "$(which inkscape)"; true)"; REAL="${REAL%/inkscape}/.inkscape-real"; echo "$REAL"
LD_DEBUG=libs "$REAL" 2>&1 | grep -E 'libxml2|libxslt' | sed -n '1,80p'
#+END_SRC

Workarounds:
- Prefer distro/Flatpak Inkscape for now.
- Or use a known-good Guix generation *only* for Inkscape:
#+BEGIN_SRC bash
guix describe --generations
guix time-machine --generation=N -- shell --pure inkscape -- inkscape
#+END_SRC

We intentionally skip mixed LD_PRELOAD tricks (fragile across ICU/libxml2).
