all/.local/bin/guix-bench-pull
#!/usr/bin/env bash
# Bench fastest Guix channel mirror

# [[file:../../../guix.org::*Bench fastest Guix channel mirror][Bench fastest Guix channel mirror:1]]
#!/usr/bin/env bash
set -Eeuo pipefail

# Benchmark Guix channel mirrors for `guix pull`.
# - Per-URL result lines (to STDERR)
# - Best URL (to STDOUT only)
# Env:
#   GUIX_PULL_CANDIDATES="url1 url2 …" to override list
#   GUIX_PULL_TIMEOUT=15  (git ls-remote timeout seconds)
#   GUIX_PULL_VERBOSE=1   (default 1; controls STDERR chatter)
# Flags:
#   -v/--verbose     force verbose
#   --force-curl     skip git timing; use curl HEAD latency

VERBOSE="${GUIX_PULL_VERBOSE:-1}"
TIMEOUT="${GUIX_PULL_TIMEOUT:-15}"
FORCE_CURL=0

for a in "$@"; do
  case "$a" in
    -v|--verbose) VERBOSE=1 ;;
    --force-curl) FORCE_CURL=1 ;;
    *) ;;
  esac
done

# Default candidates (include Codeberg)
CANDIDATES=(
  "https://git.savannah.gnu.org/git/guix.git"
  "https://mirror.git.savannah.gnu.org/r/guix.git"
  "https://git.cbaines.net/guix/guix"
  "https://codeberg.org/guix/guix.git"
)
[ -n "${GUIX_PULL_CANDIDATES:-}" ] && read -r -a CANDIDATES <<<"${GUIX_PULL_CANDIDATES}"

have_git=0
if [ "$FORCE_CURL" -eq 0 ] && command -v git >/dev/null 2>&1; then
  have_git=1
fi

ptime_git() { # -> float seconds or 99
  local url="$1" t
  t="$( TIMEFORMAT=%R; { time git ls-remote --heads --tags --refs --timeout="$TIMEOUT" "$url" >/dev/null 2>&1; } 2>&1 )" || t=99
  printf '%s' "$t"
}

ptime_curl() { # -> float seconds or 99
  curl -sS -o /dev/null -m "$TIMEOUT" -w '%{time_total}' -I "$1" || printf '%s' 99
}

mode_desc() { [ "$have_git" -eq 1 ] && echo "git" || echo "curl"; }

[ "$VERBOSE" -eq 1 ] && {
  >&2 echo "guix-bench-pull: probing ${#CANDIDATES[@]} candidate(s) using $(mode_desc)… (timeout=${TIMEOUT}s)"
}

best=""; best_t="999999"
any_ok=0

# header
[ "$VERBOSE" -eq 1 ] && >&2 printf '%-52s  %8s  %s\n' "URL" "TIME(s)" "MODE"

for url in "${CANDIDATES[@]}"; do
  # try git timing first unless forced curl / no git
  t="99"; mode="$(mode_desc)"
  if [ "$have_git" -eq 1 ]; then
    t="$(ptime_git "$url")"
    if [ "$t" = "99" ]; then
      # fallback to curl latency for this URL only
      t="$(ptime_curl "$url")"
      mode="curl"
    fi
  else
    t="$(ptime_curl "$url")"
    mode="curl"
  fi

  [ "$t" != "99" ] && any_ok=1

  # pretty row
  [ "$VERBOSE" -eq 1 ] && >&2 printf '%-52s  %8s  %s\n' "$url" "$t" "$mode"

  # numeric compare (float-safe)
  awk -v a="$t" -v b="$best_t" 'BEGIN{exit (a+0<b+0)?0:1}' \
  && { best="$url"; best_t="$t"; }
done

if [ -n "$best" ] && [ "$any_ok" -eq 1 ]; then
  [ "$VERBOSE" -eq 1 ] && >&2 echo "best=${best} time=${best_t}"
  echo "$best"
  exit 0
fi

# If absolutely everything failed (all 99), still return a sane default.
fallback="https://git.savannah.gnu.org/git/guix.git"
[ "$VERBOSE" -eq 1 ] && >&2 echo "guix-bench-pull: all probes failed; falling back to ${fallback}"
echo "$fallback"
exit 0
# Bench fastest Guix channel mirror:1 ends here
